Revit 2027 API
NumberSystem.Create Method
Overload List
Name | Description
Create(Document, ElementId, LinkElementId, Reference) |  Creates a new instance of a NumberSystem associated to a host element and a view.
Create(Document, ElementId, LinkElementId, StairsNumberSystemReferenceOption, LinkElementId) |  Creates a new instance of a NumberSystem associated to a host element, a view, and a reference level of stairs if in a multistory stairs.
Top
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace